finished/lambdas_blog.org
#+DATE: [2016-01-21 Tue 00:04]
#+TITLE: Java 8 in programming contests
#+DATE: <2016-05-22 Sun>
#+AUTHOR: Robert Kozikowski
#+EMAIL: r.kozikowski@gmail.com
#+BLOG: wordpress
#+POSTID: 186
#+OPTIONS: toc:2
* Introduction
Java 8 streams and lambdas are a big improvement over Java 7.

Java 8 streams are like iterators that support transforming intermediate state
and result of iteration using functions created by lambdas.
If this sentence seems too foreign,
you should read more basic introduction to streams first.
Many common, dull tasks can be implemented using Java 8 streams and lambdas in
significantly less code than Java 7 or C++. I would even dare to say,
that in many cases C++ is the more "boilerplate" option now,
and it's coming from person who used C++ for several years in programming
contests.

I will discuss a few code snippets using new Java 8 idioms that I found
particularly interesting and useful in programming contests like Topcoder.
** Comparison with C++
Some people are going to say "But C++ 11 have lambdas as well!".
Even if C++ have lambdas, the standard library wasn't really 
adapted to use them. Let's look at some contrived example of
a function returning a new vector/array containing odd 
elements divided by 2.
C++11 lambdas look *horrible*:
#+BEGIN_SRC cpp
  vector<int> get_divided_by_2(const vector<int>& v) {
    vector<int> filtered;
    copy_if(v.begin(), v.end(),
            back_inserter(filtered), [](int x) { return x % 2 == 0;});
    vector<int> transformed;
    transform(filtered.begin(), filtered.end(), back_inserter(transformed), 
        [](int x) { return x / 2;});
    return transformed;
#+END_SRC

On the other hand, Java 8 lambdas are quite clean:
#+BEGIN_SRC java
  int[] getDividedBy2(int[] arr) {
    return Arrays.stream(arr)
        .filter(x -> x%2 == 0)
        .map(x -> x/2)
        .toArray();
  }
#+END_SRC
** Performance
Streams are slower than for loops. On the other hand,
during the last few hundreds programs implemented in Java during the
programming contests I never hit the time limit because of streams and I used
them quite heavily.

Major source of slowness of streams API is their relative newness.
Compilers have been optimised for years for efficient JITing of imperative
loops. As the new versions of JVMs will adapt to streams,
the gap is going to get smaller.

[[http://cs.yale.edu/homes/xs45/pdf/ssgos-vldb2014.pdf][There is an interesting paper from Oracle mentioning framework for executing Java 8 streams on distributed systems, including Spark.]]
In dynamic compilation section, it says:

#+BEGIN_EXAMPLE
This design (JIT compatibility of Java 8 streams) allows the performance of 
streams to continue to improve as the Java runtime environment improves,
resulting in highly efficient stream execution. An important design principle
is to ensure the classes for methods invoked in critical loops can be 
determined by the JIT when the loop is compiled, as this allows the inner
methods to be inlined and the loop to be intelligently unrolled.
#+END_EXAMPLE

If streams will be intelligently unrolled and JIT-ed,
the performance overhead of streams is going to be close to zero.
Given that this sentence is from official paper by Oracle,
and it plays into their "big data" ambitions,
I would say we could get streams JITing sooner than later.
[[https://jaxenter.com/java-performance-tutorial-how-fast-are-the-java-8-streams-118830.html][If you are interested in further reading, you may also take a look at this post.]]
* Snippets
