lambdas_blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-05-20 Fri 19:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="rkoziko" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Introduction</a></li>
<li><a href="#orgheadline2">2. Comparison with C++</a></li>
<li><a href="#orgheadline3">3. Performance</a></li>
<li><a href="#orgheadline4">4. Reading an array of ints</a></li>
<li><a href="#orgheadline5">5. Printing an array of ints</a></li>
<li><a href="#orgheadline6">6. Initialize the graph</a></li>
<li><a href="#orgheadline7">7. Less boilerplate Bigints</a></li>
<li><a href="#orgheadline8">8. Counting objects using groupingBy stream or new Map methods</a></li>
<li><a href="#orgheadline9">9. Streams on chars in the String</a></li>
<li><a href="#orgheadline10">10. “Normalize” an array</a></li>
<li><a href="#orgheadline11">11. Find neighbours in the 2d array</a></li>
<li><a href="#orgheadline12">12. Caveats</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Java 8 streams and lambdas are a big improvement over Java 7.
</p>

<p>
Java 8 streams are like iterators that support transforming intermediate state
and result of iteration using functions created by lambdas.
If this sentence seems too foreign,
you should read more basic introduction to streams first.
Many common, dull tasks can be implemented using Java 8 streams and lambdas in
significantly less code than Java 7 or C++. I would even dare to say,
that in many cases C++ is the more "boilerplate" option now,
and it's coming from person who used C++ for several years in programming
contests.
</p>

<p>
I will discuss a few code snippets using new Java 8 idioms that I found
particularly interesting and useful in programming contests like Topcoder.
</p>
</div>
</div>
<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Comparison with C++</h2>
<div class="outline-text-2" id="text-2">
<p>
Some people are going to say "But C++ 11 have lambdas as well!".
Even if C++ have lambdas, the standard library wasn't really 
adapted to use them. Let's look at some contrived example of
a function returning a new vector/array containing odd 
elements divided by 2.
C++11 lambdas look <code>horrible</code>:
</p>
<div class="org-src-container">

<pre class="src src-C++"><span style="color: #268bd2;">vector</span><span style="color: #839496;">&lt;</span><span style="color: #268bd2;">int</span><span style="color: #839496;">&gt;</span> <span style="color: #b58900;">get_divided_by_2</span><span style="color: #839496;">(</span><span style="color: #859900;">const</span> <span style="color: #268bd2;">vector</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">int</span><span style="color: #2aa198;">&gt;</span>&amp; <span style="color: #6c71c4;">v</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
  <span style="color: #268bd2;">vector</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">int</span><span style="color: #2aa198;">&gt;</span> <span style="color: #6c71c4;">filtered</span>;
  copy_if<span style="color: #2aa198;">(</span>v.begin<span style="color: #b58900;">()</span>, v.end<span style="color: #b58900;">()</span>, back_inserter<span style="color: #b58900;">(</span>filtered<span style="color: #b58900;">)</span>, <span style="color: #b58900;">[](</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">x</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span> <span style="color: #859900;">return</span> x % 2 == 0;<span style="color: #b58900;">}</span><span style="color: #2aa198;">)</span>;
  <span style="color: #268bd2;">vector</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">int</span><span style="color: #2aa198;">&gt;</span> <span style="color: #6c71c4;">transformed</span>;
  transform<span style="color: #2aa198;">(</span>filtered.begin<span style="color: #b58900;">()</span>, filtered.end<span style="color: #b58900;">()</span>, back_inserter<span style="color: #b58900;">(</span>transformed<span style="color: #b58900;">)</span>, 
      <span style="color: #b58900;">[](</span><span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">x</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">{</span> <span style="color: #859900;">return</span> x / 2;<span style="color: #b58900;">}</span><span style="color: #2aa198;">)</span>;
  <span style="color: #859900;">return</span> transformed;
</pre>
</div>

<p>
On the other hand, Java 8 lambdas are quite clean:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">int</span><span style="color: #839496;">[]</span> <span style="color: #b58900;">getDividedBy2</span><span style="color: #839496;">(</span><span style="color: #268bd2;">int</span><span style="color: #2aa198;">[]</span> <span style="color: #6c71c4;">arr</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
  <span style="color: #859900;">return</span> Arrays.stream<span style="color: #2aa198;">(</span>arr<span style="color: #2aa198;">)</span>.filter<span style="color: #2aa198;">(</span>x -&gt; x%2 == 0<span style="color: #2aa198;">)</span>.map<span style="color: #2aa198;">(</span>x -&gt; x/2<span style="color: #2aa198;">)</span>.toArray<span style="color: #2aa198;">()</span>;
<span style="color: #839496;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> Performance</h2>
<div class="outline-text-2" id="text-3">
<p>
Streams are slower than for loops. On the other hand,
during the last few hundreds programs implemented in Java during the
programming contests I never hit the time limit because of streams and I used
them quite heavily.
</p>

<p>
Major source of slowness of streams API is their relative newness.
Compilers have been optimised for years for efficient JITing of imperative
loops. As the new versions of JVMs will adapt to streams,
the gap is going to get smaller.
</p>

<p>
<a href="http://cs.yale.edu/homes/xs45/pdf/ssgos-vldb2014.pdf">There is an interesting paper from Oracle mentioning framework for executing Java 8 streams on distributed systems, including Spark.
</a>In dynamic compilation section, it says:
</p>

<pre class="example">
This design (JIT compatibility of Java 8 streams) allows the performance of 
streams to continue to improve as the Java runtime environment improves,
resulting in highly efficient stream execution. An important design principle
is to ensure the classes for methods invoked in critical loops can be 
determined by the JIT when the loop is compiled, as this allows the inner
methods to be inlined and the loop to be intelligently unrolled.
</pre>

<p>
If streams will be intelligently unrolled and JIT-ed,
the performance overhead of streams is going to be close to zero.
Given that this sentence is from official paper by Oracle,
and it plays into their "big data" ambitions,
I would say we could get streams JITing sooner than later.
<a href="https://jaxenter.com/java-performance-tutorial-how-fast-are-the-java-8-streams-118830.html">If you are interested in further reading, you may also take a look at this post.</a>
</p>
</div>
</div>
