finished/lambdas_blog.org
** Reading an array of ints
Reading an integer N in the first line, and then reading array of N entries is a chore required in majority of problems. With Java 8 streams, reading array of ints can be simply done by:
#+BEGIN_SRC java
  Scanner sc = new Scanner(System.in);
  int n = sc.nextInt();
  int[] arr = IntStream.generate(sc::nextInt)
      .limit(n)
      .toArray();
#+END_SRC

Note that Scanner is very slow and you may sometimes hit timeouts (
happened to me during Codeforces). Even if old and rusty,
BufferedReader is much faster.
Scanner solves more general problem and it does extra work that we don't need
to do, like taking encoding into consideration. BufferedReader version:
#+BEGIN_SRC java
  BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
  br.readLine(); // We won't use the result.
  int[] arr = Arrays.stream(br.readLine().split(" "))
      .mapToInt(Integer::valueOf).toArray();
#+END_SRC

String.split is inefficient, as it evaluates the regular expression. We can use another old class, StringTokenizer, to further speed this code up:
#+BEGIN_SRC java
  BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
  int n = Integer.valueOf(br.readLine());
  StringTokenizer st = new StringTokenizer(br.readLine());
  int[] arr = Stream
      .generate(st::nextToken)
      .mapToInt(Integer::valueOf)
      .limit(n)
      .toArray();
#+END_SRC

[[http://docs.oracle.com/javase/8/docs/api/java/io/BufferedReader.html#lines--][BufferedReader has a new useful method added in Java 8 - lines().]] It creates a stream out of all lines found in the input. We can create a stream out of all ints found in the input, until the EOF character is found:
#+BEGIN_SRC java
  public static IntStream streamInts() {
      final BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
      return br.lines().map(StringTokenizer::new)
          .flatMap(tok -> Stream.generate(tok::nextToken).limit(tok.countTokens()))
          .mapToInt(Integer::valueOf);
  }
#+END_SRC
I am too lazy to do the proper micro benchmark. On codeforces problem [[http://codeforces.com/contest/588/problem/C][588C]],
Scanner version exceeded the 1s timelimit,
BufferedReader version with String.split finished in 550ms,
BufferedReader with StringTokenizer finished in 400ms,
method using BufferedReader:
:lines finished in 450ms, while C++ version with scanf finished in 200ms.
** Printing an array of ints
Let's say you have an array of ints and you want to print it to standard output.
First thing that comes to mind is repeatedly calling System.out.printf. Equivalent method would be good enough in C++, but it is sometimes too slow in Java, if you have many ints to output. You may consider assembling a String and calling System.out only once.
With new Java 8 streams you can assemble array of ints into a string with less boilerplate:
#+BEGIN_SRC java
  System.out.println(Arrays.stream(ints).mapToObj(x -> x + " ")
                     .collect(StringBuilder::new, StringBuilder::append,
                              StringBuilder::append)
                     .toString());
#+END_SRC

In [[http://codeforces.com/problemset/problem/590/A][Codeforces problem 590A]] method with calling System.out.printf 500000 times exceeds the 2s timelimit, but method with assembling a String got accepted in 200ms!
