lambdas_blog.html
<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">4</span> Reading an array of ints</h2>
<div class="outline-text-2" id="text-4">
<p>
Reading an integer N in the first line, and then reading array of N entries is a chore required in majority of problems. With Java 8 streams, reading array of ints can be simply done by:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">Scanner</span> <span style="color: #6c71c4;">sc</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Scanner</span><span style="color: #839496;">(</span>System.in<span style="color: #839496;">)</span>;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">n</span> = sc.nextInt<span style="color: #839496;">()</span>;
<span style="color: #268bd2;">int</span><span style="color: #839496;">[]</span> <span style="color: #6c71c4;">arr</span> = IntStream.generate<span style="color: #839496;">(</span>sc::nextInt<span style="color: #839496;">)</span>.limit<span style="color: #839496;">(</span>n<span style="color: #839496;">)</span>.toArray<span style="color: #839496;">()</span>;
</pre>
</div>

<p>
Note that Scanner is very slow and you may sometimes hit timeouts (
happened to me during Codeforces). Even if old and rusty,
BufferedReader is much faster.
Scanner solves more general problem and it does extra work that we don't need
to do, like taking encoding into consideration. BufferedReader version:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">BufferedReader</span> <span style="color: #6c71c4;">br</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">BufferedReader</span><span style="color: #839496;">(</span><span style="color: #859900;">new</span> <span style="color: #268bd2;">InputStreamReader</span><span style="color: #2aa198;">(</span>System.in<span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>;
br.readLine<span style="color: #839496;">()</span>; <span style="color: #586e75; font-style: italic;">// </span><span style="color: #586e75; font-style: italic;">We won't use the result.</span>
<span style="color: #268bd2;">int</span><span style="color: #839496;">[]</span> <span style="color: #6c71c4;">arr</span> = Arrays.stream<span style="color: #839496;">(</span>br.readLine<span style="color: #2aa198;">()</span>.split<span style="color: #2aa198;">(</span><span style="color: #2aa198;">" "</span><span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>.mapToInt<span style="color: #839496;">(</span>Integer::valueOf<span style="color: #839496;">)</span>.toArray<span style="color: #839496;">()</span>;
</pre>
</div>

<p>
String.split is inefficient, as it evaluates the regular expression. We can use another old class, StringTokenizer, to further speed this code up:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">BufferedReader</span> <span style="color: #6c71c4;">br</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">BufferedReader</span><span style="color: #839496;">(</span><span style="color: #859900;">new</span> <span style="color: #268bd2;">InputStreamReader</span><span style="color: #2aa198;">(</span>System.in<span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>;
<span style="color: #268bd2;">int</span> <span style="color: #6c71c4;">n</span> = Integer.valueOf<span style="color: #839496;">(</span>br.readLine<span style="color: #2aa198;">()</span><span style="color: #839496;">)</span>;
<span style="color: #268bd2;">StringTokenizer</span> <span style="color: #6c71c4;">st</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">StringTokenizer</span><span style="color: #839496;">(</span>br.readLine<span style="color: #2aa198;">()</span><span style="color: #839496;">)</span>;
<span style="color: #268bd2;">int</span><span style="color: #839496;">[]</span> <span style="color: #6c71c4;">arr</span> = Stream.generate<span style="color: #839496;">(</span>st::nextToken<span style="color: #839496;">)</span>.mapToInt<span style="color: #839496;">(</span>Integer::valueOf<span style="color: #839496;">)</span>.limit<span style="color: #839496;">(</span>n<span style="color: #839496;">)</span>.toArray<span style="color: #839496;">()</span>;
BufferedReader <span style="color: #268bd2;">has</span> <span style="color: #b58900;">a</span> <span style="color: #859900;">new</span> <span style="color: #268bd2;">useful</span> method added in Java 8 - lines<span style="color: #839496;">()</span>. It creates a stream out of all lines found in the <span style="color: #268bd2;">input</span>. We can create a stream out of all ints found in the input, until the EOF character <span style="color: #268bd2;">is</span> <span style="color: #6c71c4;">found</span>:
</pre>
</div>

<p>
<a href="http://docs.oracle.com/javase/8/docs/api/java/io/BufferedReader.html#lines--">BufferedReader has a new useful method added in Java 8 - lines().</a> It creates a stream out of all lines found in the input. We can create a stream out of all ints found in the input, until the EOF character is found:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #859900;">static</span> <span style="color: #268bd2;">IntStream</span> <span style="color: #b58900;">streamInts</span><span style="color: #839496;">()</span> <span style="color: #839496;">{</span>
  <span style="color: #859900;">final</span> <span style="color: #268bd2;">BufferedReader</span> <span style="color: #6c71c4;">br</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">BufferedReader</span><span style="color: #2aa198;">(</span><span style="color: #859900;">new</span> <span style="color: #268bd2;">InputStreamReader</span><span style="color: #b58900;">(</span>System.in<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>;
  <span style="color: #859900;">return</span> br.lines<span style="color: #2aa198;">()</span>.map<span style="color: #2aa198;">(</span>StringTokenizer::<span style="color: #859900;">new</span><span style="color: #2aa198;">)</span>.flatMap<span style="color: #2aa198;">(</span>
      tok -&gt; Stream.generate<span style="color: #b58900;">(</span>tok::nextToken<span style="color: #b58900;">)</span>.limit<span style="color: #b58900;">(</span>tok.countTokens<span style="color: #859900;">()</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
      .mapToInt<span style="color: #2aa198;">(</span>Integer::valueOf<span style="color: #2aa198;">)</span>;
<span style="color: #839496;">}</span>
</pre>
</div>
<p>
I am too lazy to do the proper micro benchmark. On codeforces problem <a href="http://codeforces.com/contest/588/problem/C">588C</a>,
Scanner version exceeded the 1s timelimit,
BufferedReader version with String.split finished in 550ms,
BufferedReader with StringTokenizer finished in 400ms,
method using BufferedReader:
:lines finished in 450ms, while C++ version with scanf finished in 200ms.
</p>
</div>
</div>
<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">5</span> Printing an array of ints</h2>
<div class="outline-text-2" id="text-5">
<p>
Let's say you have an array of ints and you want to print it to standard output.
First thing that comes to mind is repeatedly calling System.out.printf. Equivalent method would be good enough in C++, but it is sometimes too slow in Java, if you have many ints to output. You may consider assembling a String and calling System.out only once.
With new Java 8 streams you can assemble array of ints into a string with less boilerplate:
</p>
<div class="org-src-container">

<pre class="src src-java">System.out.println<span style="color: #839496;">(</span>Arrays.stream<span style="color: #2aa198;">(</span>ints<span style="color: #2aa198;">)</span>.mapToObj<span style="color: #2aa198;">(</span>x -&gt; x + <span style="color: #2aa198;">" "</span><span style="color: #2aa198;">)</span>.
    collect<span style="color: #2aa198;">(</span>StringBuilder::<span style="color: #859900;">new</span>, StringBuilder::append, StringBuilder::append<span style="color: #2aa198;">)</span>.
    toString<span style="color: #2aa198;">()</span><span style="color: #839496;">)</span>;
</pre>
</div>

<p>
In <a href="http://codeforces.com/problemset/problem/590/A">Codeforces problem 590A</a> method with calling System.out.printf 500000 times exceeds the 2s timelimit, but method with assembling a String got accepted in 200ms!
</p>
</div>
</div>
