finished/lambdas_blog.org
** Initialize the graph
Although in “production” code one would use ArrayList of ArrayLists for
representing the graph,
in programming contests I often stick to ArrayList<Integer>[].
Arrays are faster than ArrayLists.
Initializing a graph used to require a for loop.
Initializing a graph with N nodes can now be done by simply:

#+BEGIN_SRC java
  ArrayList<Integer>[] graph = Stream.generate(ArrayList<Integer>::new)
      .limit(N + 1).toArray(ArrayList[]::new);
#+END_SRC

If the graph is directed, and you get the list of edges in the input, you can use
Collectors.groupingBy to initialize and read it in one go. Following snippet 
relies on undocumented property of  the Collectors::groupingBy – that that 
classifier will be applied before downstream in collector (but it’s the case in 
the current implementation of Collectors::groupingBy):
#+BEGIN_SRC java
  Scanner sc = new Scanner(System.in);
  Map<Integer, List<Integer>> graph = IntStream.range(0, m).boxed().
      collect(Collectors.groupingBy(x -> sc.nextInt(),
          Collectors.mapping(x -> sc.nextInt(), Collectors.toList())));
#+END_SRC

I couldn’t create nice enough looking snippet for initialising the undirected graph, so I would still stick with the for loop.
** Less boilerplate Bigints
Bigints in Java used to be cumbersome,
as Java does not support operator overloading. They still are,
but streams in some cases let us save quite a lot of boilerplate.
For example see this snippet calculating a factorial using bigints:

#+BEGIN_SRC java
  Stream.iterate(BigInteger.ONE, x -> x.add(BigInteger.ONE))
      .limit(n)
      .reduce(BigInteger::multiply).get()
#+END_SRC
** Counting objects using groupingBy stream or new Map methods
Counting elements used to be quite cumbersome. It was especially cumbersome if we couldn’t use an array and we had to use the map. In Java 8 it is much easier:
#+BEGIN_SRC java
  Map<Integer, Long> m = Arrays.stream(arr).boxed().collect(
      Collectors.groupingBy(Function.identity(), Collectors.counting()));
#+END_SRC

For example, code that checks whether characters of String s can be re-arranged into palindrome:
#+BEGIN_SRC java
  s.codePoints().boxed().collect(
      Collectors.groupingBy(Function.identity(), Collectors.counting())).
      values().stream().filter(x -> (x % 2) == 1).count() <= 1
#+END_SRC

In some cases we can’t use group by and we still need to stick to map.
For example, imagine some dynamic programming problem,
where we need to both read and update values at the same time.
In java 7 it used to be quite cumbersome – there were lots of boilerplate
around checking if key is present.
[[https://blog.jooq.org/2014/02/14/java-8-friday-goodies-map-enhancements/][There are some new Map enhancements that make it easier in Java 8.]]
For example see relevant part my solution to TopCoder 671, 500 points problem BearDarts:
#+BEGIN_SRC java
  public long count(int[] w) {
      Map<Pair<Integer, Integer>, Long> dynamic = new HashMap<>();
      dynamic.put(getGcdPair(w[0], w[1]), 1L);
      return LongStream.range(2, w.length).map(i -> {
              long result = LongStream
                  .range(i + 1, w.length)
                  .map(j -> dynamic.getOrDefault(getGcdPair(w[(int) j],
                                                            w[(int) i]),
                                                 0L))
                  .sum();
              LongStream.range(0, i)
                  .forEach(j -> dynamic.merge(getGcdPair(w[(int) j],
                                                         w[(int) i]),
                                              1L,
                                              Long::sum));
              return result;
          })
          .sum();
  }
#+END_SRC

New methods getOrDefault and merge make it much easier to implement a map, that is counting some arbitrary keys. Merge lets you add the value to the map, but if some old value already exists it will merge old and new value using the given function. You can simply pass Integer::sum or Long::sum as the third value.
For people curious about the solution: getGcdPairs takes two ints x, y and returns pair of ints (x,y), with both values divided by the gcd(x,y).
