lambdas_blog.html
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">6</span> Initialize the graph</h2>
<div class="outline-text-2" id="text-6">
<p>
Although in “production” code one would use ArrayList of ArrayLists for
representing the graph,
in programming contests I often stick to ArrayList&lt;Integer&gt;[].
Arrays are faster than ArrayLists.
Initializing a graph used to require a for loop.
Initializing a graph with N nodes can now be done by simply:
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">ArrayList</span><span style="color: #839496;">&lt;</span><span style="color: #268bd2;">Integer</span><span style="color: #839496;">&gt;[]</span> <span style="color: #6c71c4;">graph</span> = Stream.generate<span style="color: #839496;">(</span><span style="color: #268bd2;">ArrayList</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">Integer</span><span style="color: #2aa198;">&gt;</span>::<span style="color: #859900;">new</span><span style="color: #839496;">)</span>.limit<span style="color: #839496;">(</span>N + 1<span style="color: #839496;">)</span>.toArray<span style="color: #839496;">(</span>ArrayList<span style="color: #2aa198;">[]</span>::<span style="color: #859900;">new</span><span style="color: #839496;">)</span>;
</pre>
</div>

<p>
If the graph is directed, and you get the list of edges in the input, you can use
Collectors.groupingBy to initialize and read it in one go. Following snippet 
relies on undocumented property of  the Collectors::groupingBy – that that 
classifier will be applied before downstream in collector (but it’s the case in 
the current implementation of Collectors::groupingBy):
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">Scanner</span> <span style="color: #6c71c4;">sc</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">Scanner</span><span style="color: #839496;">(</span>System.in<span style="color: #839496;">)</span>;
<span style="color: #268bd2;">Map</span><span style="color: #839496;">&lt;</span><span style="color: #268bd2;">Integer</span>, <span style="color: #268bd2;">List</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">Integer</span><span style="color: #2aa198;">&gt;</span><span style="color: #839496;">&gt;</span> <span style="color: #6c71c4;">graph</span> = IntStream.range<span style="color: #839496;">(</span>0, m<span style="color: #839496;">)</span>.boxed<span style="color: #839496;">()</span>.
    collect<span style="color: #839496;">(</span>Collectors.groupingBy<span style="color: #2aa198;">(</span>x -&gt; sc.nextInt<span style="color: #b58900;">()</span>,
        Collectors.mapping<span style="color: #b58900;">(</span>x -&gt; sc.nextInt<span style="color: #859900;">()</span>, Collectors.toList<span style="color: #859900;">()</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>;
</pre>
</div>

<p>
I couldn’t create nice enough looking snippet for initialising the undirected graph, so I would still stick with the for loop.
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">7</span> Less boilerplate Bigints</h2>
<div class="outline-text-2" id="text-7">
<p>
Bigints in Java used to be cumbersome,
as Java does not support operator overloading. They still are,
but streams in some cases let us save quite a lot of boilerplate.
For example see this snippet calculating a factorial using bigints:
</p>

<div class="org-src-container">

<pre class="src src-java">Stream.iterate<span style="color: #839496;">(</span><span style="color: #268bd2;">BigInteger</span>.ONE, x -&gt; x.add<span style="color: #2aa198;">(</span><span style="color: #268bd2;">BigInteger</span>.ONE<span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>.limit<span style="color: #839496;">(</span>n<span style="color: #839496;">)</span>.reduce<span style="color: #839496;">(</span>BigInteger::multiply<span style="color: #839496;">)</span>.get<span style="color: #839496;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">8</span> Counting objects using groupingBy stream or new Map methods</h2>
<div class="outline-text-2" id="text-8">
<p>
Counting elements used to be quite cumbersome. It was especially cumbersome if we couldn’t use an array and we had to use the map. In Java 8 it is much easier:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">Map</span><span style="color: #839496;">&lt;</span><span style="color: #268bd2;">Integer</span>, <span style="color: #268bd2;">Long</span><span style="color: #839496;">&gt;</span> <span style="color: #6c71c4;">m</span> = Arrays.stream<span style="color: #839496;">(</span>arr<span style="color: #839496;">)</span>.boxed<span style="color: #839496;">()</span>.collect<span style="color: #839496;">(</span>
    Collectors.groupingBy<span style="color: #2aa198;">(</span>Function.identity<span style="color: #b58900;">()</span>, Collectors.counting<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>;
</pre>
</div>

<p>
For example, code that checks whether characters of String s can be re-arranged into palindrome:
</p>
<div class="org-src-container">

<pre class="src src-java">s.codePoints<span style="color: #839496;">()</span>.boxed<span style="color: #839496;">()</span>.collect<span style="color: #839496;">(</span>
    Collectors.groupingBy<span style="color: #2aa198;">(</span>Function.identity<span style="color: #b58900;">()</span>, Collectors.counting<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>.
    values<span style="color: #839496;">()</span>.stream<span style="color: #839496;">()</span>.filter<span style="color: #839496;">(</span>x -&gt; <span style="color: #2aa198;">(</span>x % 2<span style="color: #2aa198;">)</span> == 1<span style="color: #839496;">)</span>.count<span style="color: #839496;">()</span> &lt;= 1
</pre>
</div>

<p>
In some cases we can’t use group by and we still need to stick to map.
For example, imagine some dynamic programming problem,
where we need to both read and update values at the same time.
In java 7 it used to be quite cumbersome – there were lots of boilerplate
around checking if key is present.
<a href="https://blog.jooq.org/2014/02/14/java-8-friday-goodies-map-enhancements/">There are some new Map enhancements that make it easier in Java 8.</a>
For example see relevant part my solution to TopCoder 671, <a href="https://blog.jooq.org/2014/02/14/java-8-friday-goodies-map-enhancements/">500 points problem BearDarts:</a>
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">public</span> <span style="color: #268bd2;">long</span> <span style="color: #b58900;">count</span><span style="color: #839496;">(</span><span style="color: #268bd2;">int</span><span style="color: #2aa198;">[]</span> <span style="color: #6c71c4;">w</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
    <span style="color: #268bd2;">Map</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">Pair</span><span style="color: #b58900;">&lt;</span><span style="color: #268bd2;">Integer</span>, <span style="color: #268bd2;">Integer</span><span style="color: #b58900;">&gt;</span>, <span style="color: #268bd2;">Long</span><span style="color: #2aa198;">&gt;</span> <span style="color: #6c71c4;">dynamic</span> = <span style="color: #859900;">new</span> <span style="color: #268bd2;">HashMap</span><span style="color: #2aa198;">&lt;&gt;()</span>;
    dynamic.put<span style="color: #2aa198;">(</span>getGcdPair<span style="color: #b58900;">(</span>w<span style="color: #859900;">[</span>0<span style="color: #859900;">]</span>, w<span style="color: #859900;">[</span>1<span style="color: #859900;">]</span><span style="color: #b58900;">)</span>, 1L<span style="color: #2aa198;">)</span>;
    <span style="color: #859900;">return</span> LongStream.range<span style="color: #2aa198;">(</span>2, w.length<span style="color: #2aa198;">)</span>.map<span style="color: #2aa198;">(</span>i -&gt; <span style="color: #b58900;">{</span>
        <span style="color: #268bd2;">long</span> <span style="color: #6c71c4;">result</span> = LongStream.range<span style="color: #859900;">(</span>i + 1, w.length<span style="color: #859900;">)</span>.map<span style="color: #859900;">(</span>j -&gt; dynamic.getOrDefault<span style="color: #268bd2;">(</span>
                getGcdPair<span style="color: #839496;">(</span>w<span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">int</span><span style="color: #b58900;">)</span> j<span style="color: #2aa198;">]</span>, w<span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">int</span><span style="color: #b58900;">)</span> i<span style="color: #2aa198;">]</span><span style="color: #839496;">)</span>, 0L<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>.sum<span style="color: #859900;">()</span>;
        LongStream.range<span style="color: #859900;">(</span>0, i<span style="color: #859900;">)</span>.forEach<span style="color: #859900;">(</span>j -&gt; dynamic.merge<span style="color: #268bd2;">(</span>
                getGcdPair<span style="color: #839496;">(</span>w<span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">int</span><span style="color: #b58900;">)</span> j<span style="color: #2aa198;">]</span>, w<span style="color: #2aa198;">[</span><span style="color: #b58900;">(</span><span style="color: #268bd2;">int</span><span style="color: #b58900;">)</span> i<span style="color: #2aa198;">]</span><span style="color: #839496;">)</span>, 1L, Long::sum<span style="color: #268bd2;">)</span><span style="color: #859900;">)</span>;
        <span style="color: #859900;">return</span> result;
    <span style="color: #b58900;">}</span><span style="color: #2aa198;">)</span>.sum<span style="color: #2aa198;">()</span>;
<span style="color: #839496;">}</span>
</pre>
</div>

<p>
New methods getOrDefault and merge make it much easier to implement a map, that is counting some arbitrary keys. Merge lets you add the value to the map, but if some old value already exists it will merge old and new value using the given function. You can simply pass Integer::sum or Long::sum as the third value.
For people curious about the solution: getGcdPairs takes two ints x, y and returns pair of ints (x,y), with both values divided by the gcd(x,y).
</p>
</div>
</div>
