finished/lambdas_blog.org
** Streams on chars in the String
Converting characters in the String to a stream is quite useful.
There are two new methods added in Java 8 – [[https://docs.oracle.com/javase/8/docs/api/java/lang/CharSequence.html#chars--][CharSequence::chars]] and [[https://docs.oracle.com/javase/8/docs/api/java/lang/CharSequence.html#codePoints--][CharSequence::codePoints.]]

CharSequence::chars method have a weird “quirk”.
Rather than returning a stream of characters, it return an IntStream.
[[http://stackoverflow.com/questions/22435833/why-is-string-chars-a-stream-of-ints-in-java-8][The reason seems to be that Java 8 designers decided that creating a new type for primitive chars stream is not worth the additional code.]]
In the case of dealing with ASCII strings,
like we do in programming contests those two methods are equivalent and will
return an int stream of ASCII codes.

At this point it’s worth to add that there are two types of stream,
“primitive” streams like IntStream, and “object” streams like Stream<Integer>. 
There is no CharStream, but there is Stream<Character>.
If you are willing to pay additional performance cost of boxing,
at any point you can:
#+BEGIN_SRC java
  Stream<Character> characterStream(String s) {
    return s.codePoints().mapToObj(c -> (char) c);
  }
#+END_SRC

On the other hand, it usually doesn’t make sense to convert an int to Character.

[[https://docs.oracle.com/javase/8/docs/api/java/lang/Character.html#toLowerCase-int-][Character utility methods are adapted to work with an int codePoint.]]
Therefore, it makes sense to stop working with code points,
only when printing results or returning the String. For example,
let’s say we want to print sorted, unique letters in the String.
If we want to just print results we can cast int to char when printing:
#+BEGIN_SRC java
  void printUniqueLetters(String s) {
    s.codePoints()
        .filter(Character::isLetter)
        .map(Character::toLowerCase).
    sorted()
        .distinct()
        .forEach(c -> System.out.print((char) c));
  }
#+END_SRC

Note that printing strings character by character is inefficient. I, in fact,
exceeded the 1s time limit in the [[https://www.hackerrank.com/challenges/sherlock-and-the-beast][Sherlock and The Beast hackerrank problem]] by
calling System.out.print on 10^5 chars, but passed all tests in 0.
5s when printing a string assembled using the StringBuilder.
There is no nice built in utility for assembling a stream back to String.
The best way I found uses the StringBuilder – [[http://stackoverflow.com/questions/20266422/simplest-way-to-print-an-intstream-as-a-string][see discussion on stack overflow.]]
Version of previous snippet that returns the String:
#+BEGIN_SRC java
  static String uniqueLetters(String s) {
    return s.codePoints()
        .filter(Character::isLetter)
        .map(Character::toLowerCase)
        .sorted().distinct().
        collect(StringBuilder::new,
                StringBuilder::appendCodePoint, StringBuilder::append).
        toString();
  }
#+END_SRC
** “Normalize” an array
Sometimes we are faced with an array consisting of big numbers, for example
#+BEGIN_EXAMPLE
1000000007 13 100000000000000007 1000000007 13    
#+END_EXAMPLE

We do not care about the absolute value of the entry, but we care about the relative “lower than” relation between entries. E.g. we want to transform the above array into:
#+BEGIN_EXAMPLE
1 0 2 1 0
#+END_EXAMPLE
Example of relatively short Java 8 snippet solving this problem:
#+BEGIN_SRC java
  int[] normalizePreservingOrder(int[] arr) {
    int[] distinct = Arrays.stream(arr)
        .sorted().distinct()
        .toArray();
    Map<Integer, Integer> m = IntStream
        .range(0, distinct.length).boxed()
        .collect(Collectors.toMap(i -> distinct[i],
                                  Function.identity()));
    return Arrays.stream(arr).map(m::get).toArray();
  }
#+END_SRC
** Find neighbors in the 2d array
Quite often, we want to iterate neighbouring cells in the array. So for indexes i,j we want to visit (i-1,j), (i+1,j), (i,j-1) and (i,j+1). It makes sense to generate a list of “moves”, containing four allowed vectors. I use following snippet:
#+BEGIN_SRC java
  List<Pair<Integer, Integer>> moves = IntStream
      .range(-1, 2).boxed()
      .flatMap(x -> IntStream.range(-1, 2).boxed().map(y -> pairOf(x, y)))
      .filter(x -> Math.abs(x.first + x.second) == 1)
      .collect(Collectors.toList());
#+END_SRC

Even if java does not have built in pair I found out that javafx.util.Pair gets accepted on topcoder.
