lambdas_blog.html
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">9</span> Streams on chars in the String</h2>
<div class="outline-text-2" id="text-9">
<p>
Converting characters in the String to a stream is quite useful.
There are two new methods added in Java 8 – <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/CharSequence.html#chars--">CharSequence::chars</a> and <a href="https://docs.oracle.com/javase/8/docs/api/java/lang/CharSequence.html#codePoints--">CharSequence::codePoints.</a>
</p>

<p>
CharSequence::chars method have a weird “quirk”.
Rather than returning a stream of characters, it return an IntStream.
<a href="http://stackoverflow.com/questions/22435833/why-is-string-chars-a-stream-of-ints-in-java-8">The reason seems to be that Java 8 designers decided that creating a new type for primitive chars stream is not worth the additional code.</a>
In the case of dealing with ASCII strings,
like we do in programming contests those two methods are equivalent and will
return an int stream of ASCII codes.
</p>

<p>
At this point it’s worth to add that there are two types of stream,
“primitive” streams like IntStream, and “object” streams like Stream&lt;Integer&gt;. 
There is no CharStream, but there is Stream&lt;Character&gt;.
If you are willing to pay additional performance cost of boxing,
at any point you can:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">Stream</span><span style="color: #839496;">&lt;</span><span style="color: #268bd2;">Character</span><span style="color: #839496;">&gt;</span> <span style="color: #b58900;">characterStream</span><span style="color: #839496;">(</span><span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">s</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
  <span style="color: #859900;">return</span> s.codePoints<span style="color: #2aa198;">()</span>.mapToObj<span style="color: #2aa198;">(</span>c -&gt; <span style="color: #b58900;">(</span><span style="color: #268bd2;">char</span><span style="color: #b58900;">)</span> c<span style="color: #2aa198;">)</span>;
<span style="color: #839496;">}</span>
</pre>
</div>

<p>
On the other hand, it usually doesn’t make sense to convert an int to Character.
</p>

<p>
<a href="https://docs.oracle.com/javase/8/docs/api/java/lang/Character.html#toLowerCase-int-">Character utility methods are adapted to work with an int codePoint.</a>
Therefore, it makes sense to stop working with code points,
only when printing results or returning the String. For example,
let’s say we want to print sorted, unique letters in the String.
If we want to just print results we can cast int to char when printing:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">void</span> <span style="color: #b58900;">printUniqueLetters</span><span style="color: #839496;">(</span><span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">s</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
  s.codePoints<span style="color: #2aa198;">()</span>.filter<span style="color: #2aa198;">(</span>Character::isLetter<span style="color: #2aa198;">)</span>.map<span style="color: #2aa198;">(</span>Character::toLowerCase<span style="color: #2aa198;">)</span>.
  sorted<span style="color: #2aa198;">()</span>.distinct<span style="color: #2aa198;">()</span>.forEach<span style="color: #2aa198;">(</span>c -&gt; System.out.print<span style="color: #b58900;">(</span><span style="color: #859900;">(</span><span style="color: #268bd2;">char</span><span style="color: #859900;">)</span> c<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>;
<span style="color: #839496;">}</span>
</pre>
</div>

<p>
Note that printing strings character by character is inefficient. I, in fact,
exceeded the 1s time limit in the <a href="https://www.hackerrank.com/challenges/sherlock-and-the-beast">Sherlock and The Beast hackerrank problem</a> by
calling System.out.print on 10^5 chars, but passed all tests in 0.
5s when printing a string assembled using the StringBuilder.
There is no nice built in utility for assembling a stream back to String.
The best way I found uses the StringBuilder – <a href="http://stackoverflow.com/questions/20266422/simplest-way-to-print-an-intstream-as-a-string">see discussion on stack overflow.</a>
Version of previous snippet that returns the String:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #859900;">static</span> <span style="color: #268bd2;">String</span> <span style="color: #b58900;">uniqueLetters</span><span style="color: #839496;">(</span><span style="color: #268bd2;">String</span> <span style="color: #6c71c4;">s</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
  <span style="color: #859900;">return</span> s.codePoints<span style="color: #2aa198;">()</span>.filter<span style="color: #2aa198;">(</span>Character::isLetter<span style="color: #2aa198;">)</span>.map<span style="color: #2aa198;">(</span>Character::toLowerCase<span style="color: #2aa198;">)</span>.
      sorted<span style="color: #2aa198;">()</span>.distinct<span style="color: #2aa198;">()</span>.
      collect<span style="color: #2aa198;">(</span>StringBuilder::<span style="color: #859900;">new</span>, StringBuilder::appendCodePoint, StringBuilder::append<span style="color: #2aa198;">)</span>.
      toString<span style="color: #2aa198;">()</span>;
<span style="color: #839496;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">10</span> “Normalize” an array</h2>
<div class="outline-text-2" id="text-10">
<p>
Sometimes we are faced with an array consisting of big numbers, for example
</p>
<pre class="example">
1000000007 13 100000000000000007 1000000007 13
</pre>

<p>
We do not care about the absolute value of the entry, but we care about the relative “lower than” relation between entries. E.g. we want to transform the above array into:
</p>
<pre class="example">
1 0 2 1 0
</pre>
<p>
Example of relatively short Java 8 snippet solving this problem:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">int</span><span style="color: #839496;">[]</span> <span style="color: #b58900;">normalizePreservingOrder</span><span style="color: #839496;">(</span><span style="color: #268bd2;">int</span><span style="color: #2aa198;">[]</span> <span style="color: #6c71c4;">arr</span><span style="color: #839496;">)</span> <span style="color: #839496;">{</span>
  <span style="color: #268bd2;">int</span><span style="color: #2aa198;">[]</span> <span style="color: #6c71c4;">distinct</span> = Arrays.stream<span style="color: #2aa198;">(</span>arr<span style="color: #2aa198;">)</span>.sorted<span style="color: #2aa198;">()</span>.distinct<span style="color: #2aa198;">()</span>.toArray<span style="color: #2aa198;">()</span>;
  <span style="color: #268bd2;">Map</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">Integer</span>, <span style="color: #268bd2;">Integer</span><span style="color: #2aa198;">&gt;</span> <span style="color: #6c71c4;">m</span> = IntStream.range<span style="color: #2aa198;">(</span>0, distinct.length<span style="color: #2aa198;">)</span>.boxed<span style="color: #2aa198;">()</span>.collect<span style="color: #2aa198;">(</span>
      Collectors.toMap<span style="color: #b58900;">(</span>i -&gt; distinct<span style="color: #859900;">[</span>i<span style="color: #859900;">]</span>, Function.identity<span style="color: #859900;">()</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>;
  <span style="color: #859900;">return</span> Arrays.stream<span style="color: #2aa198;">(</span>arr<span style="color: #2aa198;">)</span>.map<span style="color: #2aa198;">(</span>m::get<span style="color: #2aa198;">)</span>.toArray<span style="color: #2aa198;">()</span>;
<span style="color: #839496;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline11" class="outline-2">
<h2 id="orgheadline11"><span class="section-number-2">11</span> Find neighbours in the 2d array</h2>
<div class="outline-text-2" id="text-11">
<p>
Quite often, we want to iterate neighbouring cells in the array. So for indexes i,j we want to visit (i-1,j), (i+1,j), (i,j-1) and (i,j+1). It makes sense to generate a list of “moves”, containing four allowed vectors. I use following snippet:
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #268bd2;">List</span><span style="color: #839496;">&lt;</span><span style="color: #268bd2;">Pair</span><span style="color: #2aa198;">&lt;</span><span style="color: #268bd2;">Integer</span>, <span style="color: #268bd2;">Integer</span><span style="color: #2aa198;">&gt;</span><span style="color: #839496;">&gt;</span> <span style="color: #6c71c4;">moves</span> = IntStream.range<span style="color: #839496;">(</span>-1, 2<span style="color: #839496;">)</span>.boxed<span style="color: #839496;">()</span>.
    flatMap<span style="color: #839496;">(</span>x -&gt; IntStream.range<span style="color: #2aa198;">(</span>-1, 2<span style="color: #2aa198;">)</span>.boxed<span style="color: #2aa198;">()</span>.map<span style="color: #2aa198;">(</span>y -&gt; pairOf<span style="color: #b58900;">(</span>x, y<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span><span style="color: #839496;">)</span>.
    filter<span style="color: #839496;">(</span>x -&gt; Math.abs<span style="color: #2aa198;">(</span>x.first + x.second<span style="color: #2aa198;">)</span> == 1<span style="color: #839496;">)</span>.
    collect<span style="color: #839496;">(</span>Collectors.toList<span style="color: #2aa198;">()</span><span style="color: #839496;">)</span>;
</pre>
</div>

<p>
Even if java does not have built in pair I found out that javafx.util.Pair gets accepted on topcoder.
</p>
</div>
</div>
