finished/lambdas_blog.org
* Summary
Java 8 is still far away from being functional language. It’s missing many features comparing to functional languages like Scala, Ocaml or Haskell. Not all features are equally useful, and some are only useful in “production”, but not in a small algorithmic problem. I solved a few codeforces and hackerrank problems in Ocaml and Scala, and the features I miss the most are:

1. Type inference. It’s not that big of a deal as people make it to be, as IntelliJ auto-generates majority of the type code. 
   For example, instead of =val x = function()=, you can type =function()=, and call [[https://www.jetbrains.com/help/idea/2016.1/extract-variable.html][Extract variable IntelliJ function,]] that will transform it to =CorrectType x = function()=.
2. Pattern matching, case classes, unpacking and built in tuples.
3. [[http://cr.openjdk.java.net/~jrose/values/values-0.html][Value types.]] [[https://en.wikipedia.org/wiki/Project_Valhalla_(Java_language)][Value types are planned for Java 10.]]

Some other features, like good support for currying or partial application are sometimes useful in the “real” production code, but not that often in programming contests. Java 8 somewhat supports them, but all attempts I have seen look worse than equivalent code in real functional languages.
 




