lambdas_blog.html
<div id="outline-container-orgheadline12" class="outline-2">
<h2 id="orgheadline12"><span class="section-number-2">12</span> Caveats</h2>
<div class="outline-text-2" id="text-12">
<p>
Java 8 is still far away from being functional language. It’s missing many features comparing to functional languages like Scala, Ocaml or Haskell. Not all features are equally useful, and some are only useful in “production”, but not in a small algorithmic problem. I solved a few codeforces and hackerrank problems in Ocaml and Scala, and the features I miss the most are:
</p>

<ol class="org-ol">
<li>Type inference. It’s not that big of a deal as people make it to be, as IntelliJ auto-generates majority of the type code.
For example, instead of <code>val x = function()</code>, you can type <code>function()</code>, and call <a href="https://en.wikipedia.org/wiki/Project_Valhalla_(Java_language)">Extract variable IntelliJ function,</a> that will transform it to <code>CorrectType x = function()</code>.</li>
<li>Pattern matching, case classes, unpacking and built in tuples.</li>
<li><a href="https://en.wikipedia.org/wiki/Project_Valhalla_(Java_language)">Value types.</a> <a href="https://en.wikipedia.org/wiki/Project_Valhalla_(Java_language)">Value types are planned for Java 10.</a></li>
</ol>

<p>
Some other features, like good support for currying or partial application are sometimes useful in the “real” production code, but not that often in programming contests. Java 8 somewhat supports them, but all attempts I have seen look worse than equivalent code in real functional languages.
</p>
</div>
</div>
</div>
</body>
</html>
